aehoppe/E70N19_Dev_Board/atsame70n19/include/component/ssc.h
/**
 * \file
 *
 * \brief Component description for SSC
 *
 * Copyright (c) 2017 Atmel Corporation, a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#ifndef _SAME70_SSC_COMPONENT_H_
#define _SAME70_SSC_COMPONENT_H_
#define _SAME70_SSC_COMPONENT_         /**< \deprecated  Backward compatibility for ASF */

/** \addtogroup SAME70_SSC Synchronous Serial Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SSC */
/* ========================================================================== */
#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'R'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO)*/
#endif

#define SSC_6078                       /**< (SSC) Module ID */
#define REV_SSC O                      /**< (SSC) Module revision */

/* -------- SSC_CR : (SSC Offset: 0x00) (/W 32) Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t RXEN:1;                    /**< bit:      0  Receive Enable                           */
    uint32_t RXDIS:1;                   /**< bit:      1  Receive Disable                          */
    uint32_t :6;                        /**< bit:   2..7  Reserved */
    uint32_t TXEN:1;                    /**< bit:      8  Transmit Enable                          */
    uint32_t TXDIS:1;                   /**< bit:      9  Transmit Disable                         */
    uint32_t :5;                        /**< bit: 10..14  Reserved */
    uint32_t SWRST:1;                   /**< bit:     15  Software Reset                           */
    uint32_t :16;                       /**< bit: 16..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SSC_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SSC_CR_OFFSET                       (0x00)                                        /**<  (SSC_CR) Control Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define SSC_CR_RXEN_Pos                     0                                              /**< (SSC_CR) Receive Enable Position */
#define SSC_CR_RXEN_Msk                     (0x1U << SSC_CR_RXEN_Pos)                      /**< (SSC_CR) Receive Enable Mask */
#define SSC_CR_RXEN                         SSC_CR_RXEN_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use SSC_CR_RXEN_Msk instead */
#define SSC_CR_RXDIS_Pos                    1                                              /**< (SSC_CR) Receive Disable Position */
#define SSC_CR_RXDIS_Msk                    (0x1U << SSC_CR_RXDIS_Pos)                     /**< (SSC_CR) Receive Disable Mask */
#define SSC_CR_RXDIS                        SSC_CR_RXDIS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use SSC_CR_RXDIS_Msk instead */
#define SSC_CR_TXEN_Pos                     8                                              /**< (SSC_CR) Transmit Enable Position */
#define SSC_CR_TXEN_Msk                     (0x1U << SSC_CR_TXEN_Pos)                      /**< (SSC_CR) Transmit Enable Mask */
#define SSC_CR_TXEN                         SSC_CR_TXEN_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use SSC_CR_TXEN_Msk instead */
#define SSC_CR_TXDIS_Pos                    9                                              /**< (SSC_CR) Transmit Disable Position */
#define SSC_CR_TXDIS_Msk                    (0x1U << SSC_CR_TXDIS_Pos)                     /**< (SSC_CR) Transmit Disable Mask */
#define SSC_CR_TXDIS                        SSC_CR_TXDIS_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use SSC_CR_TXDIS_Msk instead */
#define SSC_CR_SWRST_Pos                    15                                             /**< (SSC_CR) Software Reset Position */
#define SSC_CR_SWRST_Msk                    (0x1U << SSC_CR_SWRST_Pos)                     /**< (SSC_CR) Software Reset Mask */
#define SSC_CR_SWRST                        SSC_CR_SWRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use SSC_CR_SWRST_Msk instead */
#define SSC_CR_MASK                         (0x8303U)                                      /**< \deprecated (SSC_CR) Register MASK  (Use SSC_CR_Msk instead)  */
#define SSC_CR_Msk                          (0x8303U)                                      /**< (SSC_CR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- SSC_CMR : (SSC Offset: 0x04) (R/W 32) Clock Mode Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t DIV:12;                    /**< bit:  0..11  Clock Divider                            */
    uint32_t :20;                       /**< bit: 12..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} SSC_CMR_Type;
